#──────────────────────────────────────────────────────────────
# 필수 여부 : Y
# 필수 사유 : 자바를 구동하기 위해서는 JDK 혹은 JRE가 반드시 필요
# 공식 이미지 파일 가지고 오기
#──────────────────────────────────────────────────────────────
FROM openjdk:17
#──────────────────────────────────────────────────────────────
# 필수 여부 : N
# 필수 사유 :
# 기능     : 가상환경에서 사용할 작업 디렉토리 설정하기
#──────────────────────────────────────────────────────────────
WORKDIR /dockersample

#──────────────────────────────────────────────────────────────
# 필수 여부 : Y
# 필수 사유 : Dockerfile 기준으로 /build/libs/docker-*.jar파일을
#           Docker Container 환경의 dockersample.jar 파일로 복사(Add 명령 사용 가능)
# 기능     : 가상환경에서 사용할 작업 디렉토리 설정하기
#──────────────────────────────────────────────────────────────
# dockerfile 기준으로 /build/libs/docker-로 시작하는 jar파일을 가상환경의 dockersample.jar파일로 설정
COPY build/libs/docker-*.jar dockersample.jar
#ADD build/libs/docker-*.jar /dockersample

#──────────────────────────────────────────────────────────────
# 필수 여부 : N
# 필수 사유 :
# 기능     : 외부 포트와 연동
#──────────────────────────────────────────────────────────────
#EXPOSE 80

#──────────────────────────────────────────────────────────────
# 필수 여부 : N
# 필수 사유 :
# 기능     : 파라미터 설정 필요 시 사용
#──────────────────────────────────────────────────────────────
#ENV NAME world

#──────────────────────────────────────────────────────────────
# 필수 여부 : Y
# 필수 사유 :
# 기능     : java -jar 명령어를 사용하여 container 환경의 dockersample.jar파일 실행
#──────────────────────────────────────────────────────────────
ENTRYPOINT ["java", "-jar", "dockersample.jar"]